[
    {
        "title": "Cyclescape: BikeWatching Visualization",
        "year": "2025",
        "image": "../assets/bike_watching.png",
        "description": "An interactive map visualization on Boston's and Cambridge's bike traffic."
    },
    {
        "title": "Breakfast Cereal Sugar Visualization",
        "year": "2025",
        "image": "https://dsc106.com/labs/lab02/images/empty.svg",
        "description": "A visualization showing sugar levels in ultra-processed cereals, referencing NHS guidelines as visual thresholds for sugar consumption."
      },
    {
        "title": "Recipe Cook Time Predictor",
        "year": "2025",
        "image": "https://dsc106.com/labs/lab02/images/empty.svg",
        "description": "Predicts whether a recipe is long or short to cook using nutrition, calorie data, and preparation steps, through a logistic regression model."
      },
    {
        "title": "Image Processing App",
        "year": "2024",
        "image": "https://dsc106.com/labs/lab02/images/empty.svg",
        "description": "A basic app that applies grayscale, negative, and rotation transformations and uses KNN to classify images based on their features."
      },
    {
      "title": "Meteorite Landings Analysis",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "This project investigates patterns in meteorite landings using a dataset from NASA, computing probabilities, hypothesis testing, and analyzing mass trends over time."
    },
    {
      "title": "Taylor Swift's Songs Analysis",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "This project builds a song recommender, lyric searcher, and word cloud generator using data from Taylor Swift's discography."
    },
    {
        "title": "Beatae ad aliquam ipsa.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Illum exercitationem id magni maiores veniam reiciendis itaque neque vero minus laudantium, voluptas eaque iste quasi sequi perferendis eum expedita dolor odio! Repellat fugit, voluptatem architecto commodi placeat asperiores quasi?"
    },
    {
        "title": "Eligendi reiciendis consequuntur debitis.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aliquid quia sit quasi temporibus fugiat, molestias perspiciatis. Enim, cum sit? Obcaecati sequi eius quibusdam quo, necessitatibus cupiditate reiciendis et id illo accusamus nesciunt laborum! Doloremque esse alias unde aperiam."
    },
    {
        "title": "Omnis recusandae quisquam asperiores.",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Accusamus nulla sint, ad necessitatibus impedit mollitia possimus! Fugiat suscipit perferendis unde repellendus in iusto minima, laudantium consequuntur quasi voluptatibus odio neque nisi minus ad dicta molestias vitae. Quasi, similique."
    },
    {
        "title": "Facilis dolorum enim neque.",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Maxime repellat, laudantium odit exercitationem delectus veniam repellendus consequatur commodi qui ad dolorum ipsum doloribus cumque non! Magni cumque explicabo, iusto tenetur alias recusandae. Dolores non ut voluptatum dolore tempore?"
    },
    {
        "title": "Ad odio quibusdam quam.",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Ipsam cum eius temporibus consequatur molestiae neque adipisci recusandae debitis nobis, eaque voluptas quisquam tenetur dolorem tempore, facere quidem saepe. Possimus aut vitae est necessitatibus quidem neque id laborum praesentium."
    },
    {
        "title": "Pariatur veniam eligendi quis!",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quia magnam molestias, pariatur ipsam praesentium esse rem ex cumque, consectetur perspiciatis hic assumenda vitae corrupti nisi nobis earum sapiente possimus temporibus dolore iste fugiat porro illum sequi. Saepe, ullam."
    }
]